frontend/controllers/SiteController.php

    public function actionAbout()
    {
        $model_nosotros = Paginanosotros::findOne(1);
        $model_experiencia = Experiencia::find()->all();
        $model_maestro = Maestro::find()->all();
        $model_inciso = Incisonosotros::find()->all();
---
SELECT * FROM `incisonosotros`