frontend/controllers/SiteController.php

SELECT * FROM `paginaenlaces`
---
    public function actions()
    {
        $this->view->params['model'] = Paginacontacto::findOne(1);
        $this->view->params['model_enlaces'] = Paginaenlaces::find()->all();

SELECT * FROM `slide`
---
    public function actionIndex()
    {

        $model_inicio = Paginainicio::findOne(1);
        $model_slide = Slide::find()->all();

SELECT * FROM `experiencia`
SELECT * FROM `maestro`
---
    public function actionAbout()
    {
        $model_nosotros = Paginanosotros::findOne(1);
        $model_experiencia = Experiencia::find()->all();
        $model_maestro = Maestro::find()->all();

SELECT * FROM `comentarioespecialidad` WHERE `Especialidad_idEspecialidades` IN (1, 2, 3, 4)
SELECT `especialidad`.*, COUNT(idComentarioEspecialidad) AS cnt FROM `especialidad` LEFT JOIN `comentarioespecialidad` ON idEspecialidades=Especialidad_idEspecialidades GROUP BY `idEspecialidades`
SELECT COUNT(*) FROM `especialidad`
SELECT * FROM `especialidad` LIMIT 2
---
     public function actionCourses()
    {
        $model_portada = Paginaimagenportada::findOne(3);
        $model_especialidad = Especialidad::find()
                ->select('especialidad.*, COUNT(idComentarioEspecialidad) AS cnt')
                ->leftJoin('comentarioespecialidad','idEspecialidades=Especialidad_idEspecialidades')
                ->groupBy('idEspecialidades')
                ->with('comentarioespecialidads')
                ->all();
        $query = Especialidad::find();
        $count = $query->count();
        $pages = new Pagination(['totalCount' => $count]);
        $models = $query->offset($pages->offset)
        ->limit(2)
        ->all();