frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('admin', 'admin@admin.com', '$2y$13$Gh3FdBUNuxDlWsC4tRwCReo7UZm1sgsH9IFedvKF.cQdKaOUnPnkC', 'f3yRrudthere3f9YOUH4K1DWU_qQ1fap', 10, 1489521666, 1489521666)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $ses=$user->save() ? $user : null;